weaver/socialnetwork/evaluation/local/2024-07-16_15:27:56/workload.out
Running 30s test @ http://127.0.0.1:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 13.427ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 12.494ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.81ms    5.34ms  33.15ms   86.89%
    Req/Sec    24.36     23.58    81.00     76.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.65ms
 75.000%   12.90ms
 90.000%   19.57ms
 99.000%   33.15ms
 99.900%   43.13ms
 99.990%   53.22ms
 99.999%   53.22ms
100.000%   53.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.247     0.000000            1         1.00
       9.375     0.100000           97         1.11
       9.783     0.200000          196         1.25
      10.055     0.300000          291         1.43
      10.311     0.400000          389         1.67
      10.647     0.500000          487         2.00
      10.831     0.550000          533         2.22
      11.103     0.600000          582         2.50
      11.479     0.650000          630         2.86
      11.911     0.700000          680         3.33
      12.903     0.750000          727         4.00
      13.943     0.775000          751         4.44
      15.103     0.800000          776         5.00
      16.215     0.825000          800         5.71
      17.231     0.850000          824         6.67
      18.367     0.875000          848         8.00
      18.815     0.887500          860         8.89
      19.615     0.900000          873        10.00
      20.431     0.912500          885        11.43
      21.295     0.925000          897        13.33
      23.295     0.937500          909        16.00
      24.367     0.943750          915        17.78
      25.151     0.950000          921        20.00
      25.615     0.956250          927        22.86
      26.223     0.962500          933        26.67
      27.983     0.968750          939        32.00
      28.607     0.971875          942        35.56
      28.943     0.975000          945        40.00
      29.295     0.978125          948        45.71
      30.047     0.981250          951        53.33
      30.895     0.984375          954        64.00
      31.983     0.985938          956        71.11
      32.111     0.987500          957        80.00
      33.151     0.989062          959        91.43
      33.855     0.990625          960       106.67
      34.751     0.992188          962       128.00
      36.255     0.992969          964       142.22
      36.255     0.993750          964       160.00
      36.255     0.994531          964       182.86
      36.319     0.995313          965       213.33
      38.911     0.996094          966       256.00
      38.911     0.996484          966       284.44
      38.911     0.996875          966       320.00
      42.399     0.997266          967       365.71
      42.399     0.997656          967       426.67
      43.135     0.998047          968       512.00
      43.135     0.998242          968       568.89
      43.135     0.998437          968       640.00
      43.135     0.998633          968       731.43
      43.135     0.998828          968       853.33
      53.215     0.999023          969      1024.00
      53.215     1.000000          969          inf
#[Mean    =       12.814, StdDeviation   =        5.344]
#[Max     =       53.184, Total count    =          969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1506 requests in 30.00s, 727.66KB read
Requests/sec:     50.20
Transfer/sec:     24.25KB
